{
  "project": "ArcFlow",
  "branchName": "ralph/v1.1-delight-stickiness",
  "description": "ArcFlow v1.1 Delight & Stickiness — Swipe workspace navigation, panel color customization, drag-and-drop overhaul, and double-click rename fixes across all sidebar sections",
  "userStories": [
    {
      "id": "US-001",
      "title": "Fix folder double-click rename Enter key bug",
      "description": "As a user, I want double-click rename on folders to save when I press Enter. Currently the Enter keydown event is being swallowed by a parent handler (likely DnD keyboard sensor or folder expand/collapse), so commitRename() never fires on Enter. Fix by adding e.stopPropagation() in the rename input's onKeyDown handler in FolderHeader (FolderTree.tsx).",
      "acceptanceCriteria": [
        "Double-clicking a folder name enters inline edit mode with input auto-focused and text selected",
        "Pressing Enter in the rename input calls commitRename() and saves the new name via renameFolder()",
        "The onKeyDown handler on the rename input calls e.stopPropagation() to prevent parent handlers from intercepting Enter",
        "Pressing Escape cancels rename without saving",
        "Clicking outside (blur) saves the new name",
        "Empty or whitespace-only names are rejected and revert to original",
        "committedRef guard prevents double-commit on simultaneous blur + Enter",
        "Renamed folder name appears immediately in the UI without reload",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add double-click rename to folder items in FolderTree",
      "description": "As a user, I want to double-click items inside folders to rename them inline, matching the folder rename UX. Add inline edit state (editing, editName, inputRef, committedRef) to the folder item component in FolderTree.tsx. Double-click on folder item title should enter edit mode, and Enter/blur should save via renameItemInFolder(). Must prevent double-click from also navigating to the item's URL via e.preventDefault().",
      "acceptanceCriteria": [
        "Double-clicking a folder item's title enters inline edit mode with an input field",
        "Input shows current title, is auto-focused, and text is fully selected",
        "Enter saves via renameItemInFolder() -> renameItemInFolderInWorkspace()",
        "onKeyDown calls e.stopPropagation() to prevent event bubbling to parent handlers",
        "Escape cancels without saving",
        "Blur saves the new name",
        "Empty names are rejected and revert to original",
        "Double-click does NOT also trigger navigation to the item's URL (e.preventDefault on the double-click handler)",
        "committedRef guard prevents double-commit",
        "Renamed title appears immediately in the UI",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add double-click rename to pinned apps",
      "description": "As a user, I want to double-click a pinned app icon to rename it inline. PinnedAppsRow.tsx already has an editingApp state and handleEditSubmit/handleEditKeyDown for right-click rename. Wire up onDoubleClick on pinned app icons to trigger setEditingApp({ id: app.id, field: 'title', value: app.title }), reusing the existing inline edit UI. Must prevent double-click from also opening the app's URL.",
      "acceptanceCriteria": [
        "Double-clicking a pinned app icon enters inline edit mode using the existing editingApp state",
        "Inline input appears with current title, auto-focused with text selected",
        "Enter saves via updatePinnedApp(id, { title: newName })",
        "onKeyDown calls e.stopPropagation() to prevent event bubbling",
        "Escape cancels",
        "Blur saves",
        "Empty names rejected",
        "Double-click does NOT also open the pinned app's URL (e.preventDefault and e.stopPropagation on double-click)",
        "Renamed title updates the tooltip",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add double-click rename to open tabs in sidebar",
      "description": "As a user, I want to double-click a tab title in the sidebar to give it a custom display name. Add a tabNameOverrides state (Record<number, string>) to App.tsx stored per-workspace. Add inline edit state to DraggableTabItem. Double-click on tab title enters edit mode; Enter/blur saves to tabNameOverrides. Display custom name with italic styling and show original title in tooltip. Must prevent double-click from switching to/activating the tab.",
      "acceptanceCriteria": [
        "Double-clicking a tab title in the sidebar enters inline edit mode",
        "Input shows current display name (custom or original), auto-focused with text selected",
        "Enter saves a custom display name to a tabNameOverrides map stored in chrome.storage.local per workspace",
        "onKeyDown calls e.stopPropagation()",
        "Escape cancels",
        "Blur saves",
        "Custom name persists across sidebar re-opens (loaded from storage on workspace switch)",
        "Tabs with custom names are visually distinguished with italic text",
        "Original tab title accessible via tooltip on hover",
        "Double-click does NOT switch to or activate the tab (e.preventDefault and e.stopPropagation)",
        "Empty name input clears the custom override and reverts to original title",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add panelColor to Settings and Workspace types with storage support",
      "description": "As a developer, I need the data model updated to support panel background color customization. Add panelColor field to Settings interface in settingsStorage.ts and optional panelColor field to Workspace interface in types.ts. Update getSettings() to return a default panelColor. No schema migration needed since the field is optional with a fallback default.",
      "acceptanceCriteria": [
        "Settings interface in settingsStorage.ts has a new panelColor: string field",
        "Default panelColor value is '' (empty string, meaning use default dark theme background)",
        "Workspace interface in types.ts has a new optional panelColor?: string field",
        "getSettings() returns panelColor with the stored value or default",
        "updateSettings() can persist panelColor changes",
        "updateWorkspace() can persist workspace-level panelColor",
        "Existing settings and workspaces without panelColor load correctly (backward compatible)",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Apply panel color via CSS variables in useTheme hook",
      "description": "As a developer, I need the panel background color applied through CSS variables so the entire sidebar respects the chosen color. Add applyPanelColor(color) function to useTheme.ts that sets --color-arc-panel-bg and --color-arc-panel-bg-secondary (10% lighter variant). Add luminance check to auto-add/remove 'light-panel' class on document.documentElement when panel color is light. Update useTheme hook to apply panel color on load and listen for changes. Update index.css to define the default CSS variable values and reference them in the main sidebar background.",
      "acceptanceCriteria": [
        "New CSS variables --color-arc-panel-bg and --color-arc-panel-bg-secondary defined in index.css @theme block",
        "applyPanelColor(color) function in useTheme.ts sets both CSS variables on document.documentElement",
        "Secondary variant auto-computed as 10% lighter using the existing lightenColor pattern",
        "If color is empty string, CSS variables are removed (falls back to CSS defaults)",
        "Luminance calculation: if panel color luminance > 0.5, adds 'light-panel' class to documentElement",
        "useTheme hook calls applyPanelColor on mount with stored settings value",
        "useTheme hook listens to chrome.storage.onChanged for settings.panelColor updates",
        "Main sidebar container background references var(--color-arc-panel-bg) instead of hardcoded dark bg",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Add panel color picker UI in SettingsPanel",
      "description": "As a user, I want a 'Panel Color' section in settings to choose my sidebar background color. Add a new section in SettingsPanel.tsx near the existing 'Accent Color' section. Reuse the same COLOR_PALETTE grid (12 presets) and hex input pattern. Include a 'Reset' option to revert to default dark theme. Selecting a color calls updateSettings({ panelColor: color }) and applyPanelColor(color).",
      "acceptanceCriteria": [
        "New 'Panel Color' section appears in SettingsPanel below the Accent Color section",
        "Shows the same 12-color COLOR_PALETTE grid as accent color",
        "Includes a hex input field for custom colors",
        "Clicking a preset color immediately applies it via applyPanelColor() and persists via updateSettings()",
        "Entering a valid hex in the input applies and persists the color",
        "A 'Reset' or 'Default' option clears panelColor and reverts to default dark theme background",
        "Currently selected color shows a checkmark or ring indicator",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Add per-workspace panel color with smooth transitions",
      "description": "As a user, I want each workspace to optionally have its own panel color so switching workspaces changes the entire sidebar feel. When switching workspaces, check if the workspace has a panelColor set; if yes, apply it, otherwise fall back to the global setting. Add a color picker to the workspace context menu under 'Customize'. Add a CSS transition on background-color (200ms ease) for smooth workspace switches.",
      "acceptanceCriteria": [
        "Workspace context menu in WorkspaceSwitcher.tsx has a 'Panel Color' submenu or inline color picker",
        "Selecting a color in the workspace color picker saves via updateWorkspace(wsId, { panelColor: color })",
        "On workspace switch, if workspace.panelColor exists, it overrides the global panel color",
        "If workspace.panelColor is null/undefined/empty, falls back to the global panelColor from settings",
        "Panel background transitions smoothly with 200ms CSS transition on background-color",
        "Clearing workspace panelColor reverts to global setting",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Fix pinned apps drag-and-drop with visual feedback",
      "description": "As a user, I want to reorder pinned apps smoothly with clear visual feedback. Fix the DnD in PinnedAppsRow.tsx: ensure drag overlay shows the app icon at 32x32, other icons animate to shift with 200ms transition, source item dims to 30% opacity during drag. Make sure no accidental clicks trigger (5px activation distance on PointerSensor is preserved).",
      "acceptanceCriteria": [
        "Pinned app icons can be grabbed and dragged horizontally",
        "A styled DragOverlay shows the dragged app icon at 32x32 size",
        "Other icons animate/shift to make room for the dragged item with smooth 200ms CSS transition",
        "Source item dims to 30% opacity (opacity-30) while being dragged",
        "Drop position accurately reflects where the item will land",
        "Reorder persists via reorderPinnedApps() after drop",
        "No accidental clicks trigger when starting a drag (PointerSensor distance: 5 preserved)",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Fix folder drag-and-drop with drop indicators and expanded hit areas",
      "description": "As a user, I want to reorder folders, reorder items within folders, move items between folders, and drag tabs into folders with clear visual feedback. Fix folder DnD in FolderTree.tsx and App.tsx handleDragEnd: increase folder drop zone to full header row width, add a 2px arc-accent colored drop indicator line between items when hovering, ensure expanded/collapsed state is preserved during drag, and dim source to 30% opacity.",
      "acceptanceCriteria": [
        "Folders can be reordered among siblings by dragging with visible drop indicator line",
        "Folder items can be reordered within the same folder",
        "Folder items can be dragged from one folder to another",
        "Open tabs can be dragged into folder drop zones and create a FolderItem with correct title, url, and favIconUrl",
        "Drop zone for folders is the entire folder header row width (not just the icon)",
        "A 2px horizontal line in arc-accent color appears between items to show insertion point",
        "Folders glow/highlight with arc-accent/10 background when a draggable hovers over them",
        "Source item dims to 30% opacity during drag",
        "Expanded/collapsed state of folders is preserved during drag operations",
        "Nested folders maintain parent-child relationships during reorder",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Add open tabs reorder via drag-and-drop with persistence",
      "description": "As a user, I want to reorder open tabs in the sidebar by dragging them. Add a SortableContext with verticalListSortingStrategy wrapping the tab list in App.tsx. Convert DraggableTabItem to use useSortable instead of useDraggable. Store custom tab order per workspace in chrome.storage.local as tabOrderOverrides. Handle react-window conflict by disabling virtualization during active drag (set a isDragging flag that forces non-virtualized rendering when true).",
      "acceptanceCriteria": [
        "Tabs can be reordered within the open tabs list by dragging",
        "SortableContext with verticalListSortingStrategy wraps the tab list",
        "DraggableTabItem uses useSortable for both drag and drop capability",
        "Reordering updates the visual list immediately (optimistic UI)",
        "Tab order persists across sidebar re-opens via tabOrderOverrides in chrome.storage.local",
        "Virtual scrolling (react-window for >50 tabs) is temporarily disabled during active drag to prevent un-droppable items",
        "Drag handle grip icon is visible on hover for each tab item",
        "Source tab dims to 30% opacity during drag",
        "Dragging a tab toward a folder section still highlights folders as drop targets",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Add consistent drag overlays and cross-section drop validation",
      "description": "As a user, I want a polished drag overlay for all item types and clear feedback for invalid drops. Create a unified DragOverlay in App.tsx that renders styled preview cards (favicon + truncated title) for tabs, folder items, pinned apps, and folders. Add not-allowed cursor styling for invalid cross-section drops (e.g., folder onto pinned apps row). Ensure customCollisionDetection correctly prioritizes folder-drop targets.",
      "acceptanceCriteria": [
        "All dragged items show a styled overlay card with favicon (16x16) + truncated title text",
        "Drag overlay style matches existing TabDragOverlay pattern (dark card, rounded, shadow)",
        "Folder drag overlay also shows the folder emoji",
        "Pinned app drag overlay shows the app icon at 32x32",
        "Invalid cross-section drops show not-allowed cursor via CSS on the droppable container",
        "Tab -> Folder drop works correctly via addItemToFolder()",
        "Folder Item -> Different Folder works correctly via moveItemToFolder()",
        "No duplicate items created during cross-section moves",
        "customCollisionDetection prioritizes folder-drop targets over sortable siblings when pointer is within a folder zone",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Create useSwipeGesture hook for workspace navigation",
      "description": "As a developer, I need a custom React hook useSwipeGesture that detects horizontal swipe gestures on a ref element. The hook should handle both touch events (touchstart/touchmove/touchend) and trackpad events (wheel with deltaX). It should calculate swipe direction, enforce a 50px minimum threshold, ensure the swipe angle is < 30 degrees from horizontal (to not conflict with vertical scrolling), and call onSwipeLeft/onSwipeRight callbacks.",
      "acceptanceCriteria": [
        "New file src/sidepanel/useSwipeGesture.ts created",
        "Hook signature: useSwipeGesture(ref, { onSwipeLeft, onSwipeRight, threshold?, disabled? })",
        "Detects horizontal swipe via touchstart/touchmove/touchend events on the ref element",
        "Detects horizontal swipe via wheel event deltaX accumulation on trackpad",
        "Minimum threshold of 50px horizontal movement required to trigger a swipe",
        "Only triggers when horizontal distance > vertical distance (angle < 30 degrees from horizontal)",
        "Calls onSwipeLeft when swiping left (next workspace) and onSwipeRight when swiping right (previous workspace)",
        "disabled flag prevents all gesture detection when true",
        "Cleans up all event listeners on unmount",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Integrate swipe navigation with boundary handling into App.tsx",
      "description": "As a user, I want to swipe left/right on the sidebar to switch workspaces with a rubber-band bounce at boundaries. Integrate useSwipeGesture hook in App.tsx on the main scrollable area (not footer). onSwipeLeft switches to next workspace by sortOrder, onSwipeRight switches to previous. At boundaries (first/last workspace), add a CSS rubber-band animation (translateX bounce and return within 300ms). Disable swipe when only 1 workspace exists.",
      "acceptanceCriteria": [
        "useSwipeGesture is attached to the main scrollable content area in App.tsx",
        "Swiping left switches to the next workspace by sortOrder via setActiveWorkspace()",
        "Swiping right switches to the previous workspace by sortOrder",
        "Swiping right on the first workspace shows a rubber-band bounce animation (CSS translateX shift and return)",
        "Swiping left on the last workspace shows the same bounce animation",
        "Bounce animation completes within 300ms",
        "Swipe is disabled when only 1 workspace exists (disabled flag passed to hook)",
        "Swipe does not interfere with vertical scrolling of tabs/folders",
        "Workspace switch via swipe calls the same setActiveWorkspace() flow as clicking workspace icons",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Add workspace dot indicators and arrow buttons to footer",
      "description": "As a user, I want dot indicators and arrow buttons near the workspace switcher for spatial awareness and fallback navigation. Add to WorkspaceSwitcher.tsx: a row of small dots (6px circles, 8px apart) where the active dot uses the workspace's accent color and inactive dots are muted gray. Flank the dots with left/right arrow buttons. Left arrow disabled on first workspace, right arrow disabled on last. Arrows call the same workspace switching logic. Hide dots and arrows when only 1 workspace exists.",
      "acceptanceCriteria": [
        "Dot indicators appear in the footer area near the workspace switcher",
        "One dot per workspace, active dot highlighted with workspace's accent color",
        "Inactive dots are muted (gray-600 or similar)",
        "Dots update immediately on workspace switch (swipe, click, or keyboard shortcut)",
        "Left arrow button to the left of dots, right arrow to the right",
        "Left arrow is disabled/hidden on the first workspace",
        "Right arrow is disabled/hidden on the last workspace",
        "Clicking arrows triggers setActiveWorkspace() with the adjacent workspace by sortOrder",
        "Arrows have hover states using arc-accent-hover",
        "Dots and arrows are hidden when only 1 workspace exists",
        "Dots are 6px circles spaced 8px apart",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 15,
      "passes": false,
      "notes": ""
    }
  ]
}
