{
  "project": "ArcFlow",
  "branchName": "ralph/sidebar-dnd-organize-fixes",
  "description": "Enhanced Drag & Drop, Smart Tab Organization, and UI Fixes — Full bi-directional DnD across tabs/folders/pinned apps, Arc-style full-row dragging, AI organize with folder/workspace awareness, near-instant workspace swipe, and Save to Folder popup fixes.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Arc-style full-row tab and folder item dragging",
      "description": "As a user, I want to initiate a drag from anywhere on a tab row or folder item row (not just the left grip icon) so that dragging feels natural like in Arc browser. Move dnd-kit listeners from the grip icon to the entire <li> row in DraggableTabItem (App.tsx ~line 182) and DraggableFolderItem (FolderTree.tsx). The grip icon can remain as a subtle visual hint (opacity-0 → opacity-30 on hover) but must not be the only drag handle. Ensure PointerSensor's 5px activation distance prevents drag from interfering with click, double-click rename, and middle-click close.",
      "acceptanceCriteria": [
        "In DraggableTabItem (App.tsx): {...listeners} and {...attributes} applied to the <li> element instead of just the grip icon",
        "In DraggableFolderItem (FolderTree.tsx): same change — listeners on the full row, not just the grip handle",
        "PointerSensor activation distance remains at 5px to distinguish click from drag",
        "Single-click to switch tab still works (handleClick fires on click without drag)",
        "Double-click to rename tab still works (handleDoubleClick fires correctly)",
        "Middle-click to close tab still works (handleMouseDown with button === 1)",
        "Grip icon kept as subtle visual affordance (opacity-0 normal, opacity-30 on row hover) but not required to drag",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add droppable zones for pinned apps and tab list areas",
      "description": "As a developer, I need new droppable zones so items can be dragged between sections. In App.tsx: wrap the pinned apps area with useDroppable (id: 'pinned-drop-zone') and the open tabs list area with useDroppable (id: 'tablist-drop-zone'). Update customCollisionDetection to recognize these new drop zone IDs alongside the existing 'folder-drop:' zones. The collision detection should prefer folder-drop targets (existing behavior), then check pinned-drop-zone and tablist-drop-zone. Visual feedback: highlight pinned apps area with a subtle border/glow when a draggable hovers over it, same for tab list area.",
      "acceptanceCriteria": [
        "Pinned apps container wrapped with useDroppable, id: 'pinned-drop-zone'",
        "Open tabs list container wrapped with useDroppable, id: 'tablist-drop-zone'",
        "customCollisionDetection updated: checks folder-drop first (existing), then pinned-drop-zone and tablist-drop-zone",
        "When dragging over pinned-drop-zone: container shows subtle highlight (ring-1 ring-arc-accent/30 or similar)",
        "When dragging over tablist-drop-zone: container shows subtle highlight",
        "Highlight removed when drag leaves the zone",
        "Existing folder drop targets still work correctly (no regression)",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Cross-section drag: tab to folder and tab to pinned apps",
      "description": "As a user, I want to drag a tab from the open tabs list into a folder or onto the pinned apps area. In App.tsx handleDragEnd: add cases for (1) tab dropped on folder-drop zone — create FolderItem with type 'link' from tab URL/title/favicon and add to target folder via addItemToFolder, (2) tab dropped on pinned-drop-zone — create PinnedApp from tab URL/title/favicon via addPinnedApp storage function. The tab should remain open in both cases (not closed).",
      "acceptanceCriteria": [
        "Dragging a tab (id prefix 'tab:') onto a folder-drop zone creates a FolderItem {type: 'link', url, title, favicon} and adds it to that folder",
        "Dragging a tab onto pinned-drop-zone creates a PinnedApp {url, title, favicon, sortOrder} in the current workspace",
        "Tab remains open after being dragged to folder or pinned (not closed)",
        "If tab is already saved in the target folder (same URL), do not create duplicate — show toast or skip silently",
        "If tab URL is already pinned, do not create duplicate pinned app",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Cross-section drag: pinned app to folder and folder item to pinned apps",
      "description": "As a user, I want to drag a pinned app into a folder (saves as FolderItem) and drag a folder item onto pinned apps (creates PinnedApp). In App.tsx handleDragEnd: add cases for (1) pinned app (id prefix 'pinned:') dropped on folder-drop zone — create FolderItem from pinned app data, optionally remove from pinned apps, (2) folder-item (id prefix 'folder-item:') dropped on pinned-drop-zone — create PinnedApp from folder item data. Do NOT remove the source item automatically — the user can delete it manually if desired.",
      "acceptanceCriteria": [
        "Dragging a pinned app onto a folder-drop zone creates FolderItem {type: 'link', url, title, favicon} in that folder",
        "Dragging a folder item onto pinned-drop-zone creates PinnedApp {url, title, favicon, sortOrder}",
        "Source items are NOT removed automatically (user keeps both copies)",
        "Duplicate prevention: skip if same URL already exists in target folder or pinned apps",
        "Existing drag behaviors preserved: folder-item-to-folder moves, folder reordering, pinned app reordering",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Cross-section drag: folder item back to tab list (unpin from folder)",
      "description": "As a user, I want to drag a folder item out of a folder and onto the open tabs area to remove it from the folder. In App.tsx handleDragEnd: add case for folder-item (id prefix 'folder-item:') dropped on tablist-drop-zone. If the folder item is type 'link', open the URL in a new tab (chrome.tabs.create) and remove the FolderItem from the folder. If type 'tab' and tabId is still valid, just remove the FolderItem (the tab is already open).",
      "acceptanceCriteria": [
        "Dragging a folder item onto tablist-drop-zone removes it from its parent folder",
        "If folder item type is 'link': opens URL in a new tab via chrome.tabs.create({url}), then removes FolderItem",
        "If folder item type is 'tab' with valid tabId: just removes FolderItem (tab already open)",
        "Removal uses existing removeItemFromFolder or equivalent storage function",
        "Existing folder-item-to-folder drag (moving between folders) still works",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Update AI grouping service with folder and workspace context",
      "description": "As a developer, I need to update the AI prompt in aiGroupingService.ts to include existing folder names and workspace names as context. Update callOpenRouterAPI to accept additional parameters: folders (array of {name, itemCount}) and workspaces (array of {name}). Update the prompt to instruct the AI to: (1) suggest adding tabs to existing folders when appropriate, (2) suggest which workspace a tab might belong in. Update the response schema to include a 'target' field: 'new' for new folder, 'existing' for existing folder (with folderName), and optionally 'workspaceMove' suggestions. Update parseAIResponse to handle the new schema. Update getAIGroupingSuggestions signature to accept folders and workspaces params.",
      "acceptanceCriteria": [
        "callOpenRouterAPI accepts new params: folders: {name: string, itemCount: number}[], workspaces: {name: string}[]",
        "AI prompt includes existing folder names and item counts as context",
        "AI prompt includes workspace names as context",
        "AI prompt instructs: 'If tabs fit an existing folder, reference it by name instead of creating a new one. Also suggest workspace moves if a tab clearly belongs elsewhere.'",
        "Response schema: each group has 'target': 'new' | 'existing', optional 'existingFolderName', optional 'suggestedWorkspace'",
        "parseAIResponse validates new fields (target, existingFolderName, suggestedWorkspace) with safe fallback to 'new' if missing",
        "getAIGroupingSuggestions signature updated to accept folders and workspaces",
        "Fallback: if AI returns unrecognized target values, default to 'new'",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Update OrganizeTabsModal to handle existing folders and workspace suggestions",
      "description": "As a user, I want the Organize Tabs modal to show whether a suggestion adds to an existing folder or creates a new one, and show workspace move suggestions. In OrganizeTabsModal.tsx: (1) pass current folders and workspaces to getAIGroupingSuggestions, (2) display badge on each group: green 'New' badge for new folders, blue 'Existing' badge for existing folder matches, (3) when accepting an 'existing' group, add tabs to the existing folder (find by name) instead of creating a new one, (4) show workspace move suggestions as a separate section with purple 'Move' badge, (5) update domain-based fallback: if a domain group name matches an existing folder name (case-insensitive), mark it as 'existing'.",
      "acceptanceCriteria": [
        "OrganizeTabsModal passes current folders (with item counts) and workspace names to getAIGroupingSuggestions",
        "Each group card shows a badge: green 'New' for new folders, blue 'Existing' for existing folder matches",
        "Accepting an 'existing' group calls addItemToFolder on the matched existing folder instead of createFolder",
        "Workspace move suggestions shown in a separate 'Suggested Moves' section with purple badge",
        "Accepting a workspace move: moves tab to target workspace via tabWorkspaceMap update",
        "Domain-based fallback grouping: if group name matches existing folder name (case-insensitive), target set to 'existing'",
        "If matched existing folder is not found at accept time (deleted between suggestion and accept), fall back to creating new folder",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Near-instant workspace swipe response",
      "description": "As a user, I want workspace switching via swipe gestures to feel instant. In useSwipeGesture.ts: (1) reduce wheel accumulation timeout from 150ms to 50ms, (2) reduce default threshold from 50 to 30, (3) add a cooldown mechanism — after a successful swipe fires, ignore further swipes for 300ms to prevent double-firing. Use a useRef<boolean> cooldown flag set to true on swipe, cleared after 300ms timeout.",
      "acceptanceCriteria": [
        "wheelTimeoutRef setTimeout reduced from 150ms to 50ms",
        "Default threshold parameter changed from 50 to 30",
        "Cooldown ref added: after handleSwipe fires a callback, set cooldown flag to true",
        "Cooldown clears after 300ms timeout",
        "During cooldown, handleSwipe returns early without firing callbacks",
        "Touch swipe still fires immediately on touchend (no regression)",
        "Rapid swipes during cooldown are ignored (no double-firing or workspace skipping)",
        "Cooldown ref cleaned up in useEffect return (clear timeout)",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Fix Save to Folder popup overlay and styling",
      "description": "As a user, I want the Save to Folder popup to render correctly without clipping or overlay issues. In App.tsx FolderPickerDropdown (~line 471): (1) render via ReactDOM.createPortal to document.body to escape any parent overflow:hidden, (2) increase z-index to 9990 (below toasts at 9999 but above everything else), (3) add backdrop-frosted class and proper dark theme styling matching ContextMenu (bg-[#1e1e2a], border-white/10, shadow-2xl), (4) fix viewport edge positioning — account for Chrome side panel narrow width, use the dropdown ref's actual dimensions for edge detection instead of hardcoded 200px.",
      "acceptanceCriteria": [
        "FolderPickerDropdown rendered via ReactDOM.createPortal(jsx, document.body)",
        "z-index set to 9990 (above context menu z-50, below toast z-9999)",
        "Styling updated: backdrop-frosted (backdrop-filter: blur(16px) saturate(180%)), dark:bg-[#1e1e2a], dark:border-white/10",
        "Viewport edge detection uses ref.current.getBoundingClientRect() after render (useLayoutEffect) to adjust position based on actual dropdown dimensions",
        "Dropdown content fully visible — no clipping by parent containers",
        "Escape key and click-outside still close the dropdown",
        "Existing folder selection behavior unchanged",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Add New Folder option to Save to Folder popup",
      "description": "As a user, I want a 'New Folder' button at the bottom of the Save to Folder popup so I can create a folder and save the link in one action. In FolderPickerDropdown: (1) add a separator line after the folder list, (2) add a 'New Folder' button with a plus icon, (3) clicking it replaces the button with an inline text input + confirm/cancel buttons, (4) pressing Enter or clicking confirm: creates folder via createFolder(), then calls onSelect with the new folder's ID, (5) pressing Escape or clicking cancel: returns to the folder list view.",
      "acceptanceCriteria": [
        "'New Folder' button rendered at bottom of dropdown, separated by a thin border-t",
        "Button shows plus icon and 'New Folder' text",
        "Clicking button: hides button, shows inline text input with auto-focus",
        "Input has placeholder 'Folder name'",
        "Enter key in input: creates top-level folder via createFolder({name, parentId: null}), then calls onSelect(newFolderId) to save the link",
        "Escape key in input: hides input, shows 'New Folder' button again",
        "Empty name submission is prevented (input validation)",
        "After successful creation and save, dropdown closes (onSelect triggers close)",
        "Typecheck passes (npx tsc --noEmit)"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    }
  ]
}
